app/views/questions/index.html.erb

SELECT COUNT(*) FROM `questions` WHERE (1 = 0)
SELECT `questions`.* FROM `questions` WHERE (1 = 0)
---
        <th>
          <%= select("question", "complexity_list", Question.complexities.collect{|complexity| [complexity.name, complexity.name]}, {:prompt => 'Any', :selected => params[:complexity]}, :onchange => 'tagged_questions();', :style => 'width:100px;') %>