app/controllers/attachments_controller.rb

  def delete
    Attachment.destroy(params[:id]) unless params[:id].blank? if request.delete?
---
DELETE FROM `attachments` WHERE `attachments`.`id` = 1