app/controllers/questions_controller.rb

SELECT COUNT(*) AS count_all, questions.id HAVING COUNT(questions_taggings_group.taggable_id) = 1 AS questions_id_having_count_questions_taggings_group_taggable_id_1 FROM `questions` JOIN taggings questions_taggings_b306047 ON questions_taggings_b306047.taggable_id = questions.id AND questions_taggings_b306047.taggable_type = 'Question' AND questions_taggings_b306047.tag_id = 3 LEFT OUTER JOIN taggings questions_taggings_group ON questions_taggings_group.taggable_id = questions.id AND questions_taggings_group.taggable_type = 'Question' GROUP BY questions.id HAVING COUNT(questions_taggings_group.taggable_id) = 1
SELECT `questions`.* FROM `questions` JOIN taggings questions_taggings_43e11a5 ON questions_taggings_43e11a5.taggable_id = questions.id AND questions_taggings_43e11a5.taggable_type = 'Question' AND questions_taggings_43e11a5.tag_id = 3 JOIN taggings questions_taggings_b88ff19 ON questions_taggings_b88ff19.taggable_id = questions.id AND questions_taggings_b88ff19.taggable_type = 'Question' AND questions_taggings_b88ff19.tag_id = 4 LEFT OUTER JOIN taggings questions_taggings_group ON questions_taggings_group.taggable_id = questions.id AND questions_taggings_group.taggable_type = 'Question' GROUP BY questions.id HAVING COUNT(questions_taggings_group.taggable_id) = 2
SELECT `tags`.* FROM `tags` WHERE (name LIKE 'complexity!_qb!_easy' ESCAPE '!' OR name LIKE 'topic!_qb!_dot!_net' ESCAPE '!' OR name LIKE 'complexity!_qb!_java' ESCAPE '!' OR name LIKE 'topic!_qb!_java' ESCAPE '!')
---
  def index
    tags = filter_tags

    # http://stackoverflow.com/questions/2082399/thinking-sphinx-and-acts-as-taggable-on-plugin

    @questions = Question.tagged_with(tags, :match_all => false).paginate(:page => params[:page]) unless tags.blank?

SELECT `questions`.* FROM `questions` WHERE `questions`.`id` = 1 LIMIT 1
---
  def show
    @question = Question.find_by_id params[:id]

INSERT INTO `attachments` (`attachable_id`, `attachable_type`, `created_at`, `updated_at`, `upload_content_type`, `upload_file_name`, `upload_file_size`, `upload_updated_at`) VALUES (2, 'Statement', '2012-04-23 18:07:27', '2012-04-23 18:07:27', 'text/plain', 'for_baby.txt', 155, '2012-04-23 18:07:27')
INSERT INTO `questions` (`created_at`, `delta`, `updated_at`) VALUES ('2012-05-08 13:04:32', 1, '2012-05-08 13:04:32')
INSERT INTO `statements` (`body`, `created_at`, `statement_for_id`, `statement_for_type`, `title`, `updated_at`, `user_id`) VALUES ('<p>afadsf</p>', '2012-04-23 18:41:33', 1, 'Question', 'sdfasdf', '2012-04-23 18:41:33', 1)
---
  def create
    @statement = Statement.new(params[:statement])
    @question = Question.new(params[:question])
    @question.topic_list = params[:question][:topic_list] unless params[:question][:topic_list].blank?
    @question.statement = @statement
    @statement.user = current_user
    @question.assign_objective_options params[:objective_options]

    if @statement.save_attachments(params[:attachment]) and @question.save!

SELECT `questions`.* FROM `questions` WHERE `questions`.`id` = 1 LIMIT 1
---
  def edit
    @question = Question.find_by_id params[:id]

SELECT `questions`.* FROM `questions` WHERE `questions`.`id` = 1 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `statements` SET `body` = '<p>asfadsf</p>\r\n<p>D ASD</p>\r\n<p>ASD</p>\r\n<p>&nbsp;</p>\r\n<p>ASD</p>\r\n<p>A</p>\r\n<p>D</p>\r\n<p>ADSADS</p>', `updated_at` = '2012-04-23 18:26:56' WHERE `statements`.`id` = 1
INSERT INTO `attachments` (`attachable_id`, `attachable_type`, `created_at`, `updated_at`, `upload_content_type`, `upload_file_name`, `upload_file_size`, `upload_updated_at`) VALUES (1, 'Statement', '2012-04-23 18:27:48', '2012-04-23 18:27:48', 'application/octet-stream', 'tttttttttttttttttt', 624, '2012-04-23 18:27:48')
---
  def update
    @question = Question.find_by_id params[:id]
    @statement = @question.statement

    if @question.user != current_user
      flash[:error] = "For now, only owner can edit this."
      render :edit
      return
    end

    @question.assign_attributes params[:question]
    @question.topic_list = params[:question][:topic_list] unless params[:question][:topic_list].blank?
    @question.assign_attributes :delta => true
    @question.update_objective_options params[:objective_options]

    if @statement.save_attachments(params[:attachment]) and @statement.update_attributes(params[:statement]) and @question.save