app/controllers/statements_controller.rb

SELECT `statements`.* FROM `statements`
---
  def index
    @statements = Statement.all

SELECT `statements`.* FROM `statements` WHERE `statements`.`id` = 1 LIMIT 1
---
  def show
    @statement = Statement.find(params[:id])

INSERT INTO `attachments` (`attachable_id`, `attachable_type`, `created_at`, `updated_at`, `upload_content_type`, `upload_file_name`, `upload_file_size`, `upload_updated_at`) VALUES (1, 'Statement', '2012-04-22 05:01:55', '2012-04-22 05:01:55', 'image/png', 'Screenshot-2.png', 311107, '2012-04-22 05:01:55')
INSERT INTO `statements` (`body`, `created_at`, `title`, `updated_at`) VALUES ('asdfasdf', '2012-04-22 05:01:55', 'dfasf', '2012-04-22 05:01:55')
---
  def create
    @statement = Statement.new(params[:statement])
    @statement.save_attachments(params[:attachment])

SELECT `statements`.* FROM `statements` WHERE `statements`.`id` = 1 LIMIT 1
---
  def edit
    @statement = Statement.find(params[:id])

SELECT `statements`.* FROM `statements` WHERE `statements`.`id` = 1 LIMIT 1
INSERT INTO `attachments` (`attachable_id`, `attachable_type`, `created_at`, `updated_at`, `upload_content_type`, `upload_file_name`, `upload_file_size`, `upload_updated_at`) VALUES (1, 'Statement', '2012-04-22 05:11:08', '2012-04-22 05:11:08', 'text/plain', 'for_baby.txt', 155, '2012-04-22 05:11:08')
UPDATE `statements` SET `body` = '<p>asdfasdf</p>', `updated_at` = '2012-04-22 10:15:49' WHERE `statements`.`id` = 1
---
  def update
    @statement = Statement.find(params[:id])
    if @statement.save_attachments(params[:attachment]) and @statement.update_attributes(params[:statement])

SELECT `statements`.* FROM `statements` WHERE `statements`.`id` = 1 LIMIT 1
DELETE FROM `statements` WHERE `statements`.`id` = 1
---
  def destroy
    @statement = Statement.find(params[:id])
    @statement.destroy